<a href="https://clarusway.com/contact-us/"><img align="center" src="https://i.ibb.co/B43qn24/officially-licensed-logo.png" alt="Open in Clarusway LMS" width="110" height="200" title="This notebook is licensed by Clarusway IT training school. Please contact the authorized persons about the conditions under which you can use or share."></a>

# Example -1 Inclass Data

In [1]:
import pandas as pd
import seaborn as sns
from scipy.stats import chi2_contingency

In [2]:
table = [[15, 21, 45, 13],[26, 31, 34, 5], [33, 17, 49, 20]]

In [ ]:
# Ho: The two categorical variables are independent.
# H1: The two categorical variables are dependent.

In [4]:
chi2_contingency(table)

(19.177972167356753,
 0.0038733888380696486,
 6,
 array([[22.51132686, 20.99029126, 38.93851133, 11.55987055],
        [22.99029126, 21.4368932 , 39.76699029, 11.80582524],
        [28.49838188, 26.57281553, 49.29449838, 14.63430421]]))

In [5]:
stat, p, dof, expected = chi2_contingency(table)

In [4]:
print('stat=%.3f, p=%.4f' % (stat, p))
if p > 0.05:
	print('Fail to reject Ho')
else:
	print('We reject the null hypothesis. The two categorical variables are dependent')

stat=19.178, p=0.0039
We reject the null hypothesis. The two categorical variables are dependent

In [5]:
expected

array([[22.51132686, 20.99029126, 38.93851133, 11.55987055],
       [22.99029126, 21.4368932 , 39.76699029, 11.80582524],
       [28.49838188, 26.57281553, 49.29449838, 14.63430421]])

In [6]:
dof

6

In [7]:
# We can get the same result with manual method
from scipy import stats
1 - stats.chi2.cdf(19.17, 6)

0.0038859579107577424

# Example -2 Titanic Dataset

In [6]:
titanic = sns.load_dataset("titanic")
titanic.sample(7)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
706,1,2,female,45.0,0,0,13.5000,S,Second,woman,False,NaN,Southampton,yes,True
519,0,3,male,32.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
199,0,2,female,24.0,0,0,13.0000,S,Second,woman,False,NaN,Southampton,no,True
789,0,1,male,46.0,0,0,79.2000,C,First,man,True,B,Cherbourg,no,True
133,1,2,female,29.0,1,0,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
642,0,3,female,2.0,3,2,27.9000,S,Third,child,False,NaN,Southampton,no,False
56,1,2,female,21.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True

How many rows and columns

In [9]:
titanic.shape

(891, 15)

How many null values are there in columns?

In [10]:
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [7]:
titanic=titanic.drop(["deck", "age"], axis=1)

In [8]:
titanic=titanic.dropna()

In [9]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     889 non-null    int64
 1   pclass       889 non-null    int64
 2   sex          889 non-null    object
 3   sibsp        889 non-null    int64
 4   parch        889 non-null    int64
 5   fare         889 non-null    float64
 6   embarked     889 non-null    object
 7   class        889 non-null    category
 8   who          889 non-null    object
 9   adult_male   889 non-null    bool
 10  embark_town  889 non-null    object
 11  alive        889 non-null    object
 12  alone        889 non-null    bool
dtypes: bool(2), category(1), float64(1), int64(4), object(5)
memory usage: 79.1+ KB

In [10]:
titanic2=titanic.sample(200, random_state=42)

In [21]:
# Does gender affects survival ?

In [11]:
# We can see both male and female survivors using a crosstab
crosstab = pd.crosstab(titanic2.survived, titanic2.sex)
crosstab

sex       female  male
survived
0             24   101
1             56    19

In [14]:
# Ho: The two categorical variables (gender and survived) are independent.
# H1: The two categorical variables are dependent.

In [16]:
from scipy import stats
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=57.800, p=0.0000

In [17]:
if p > 0.05:
	print('Fail to reject Ho')
else:
	print('We reject the null hypothesis. Gender and survived variables are dependent')

We reject the null hypothesis. Gender and survived variables are dependent

# Example-3 Titanic Dataset

In [20]:
# Does class affect survival? In other words Class and survived variables are dependent or not?

In [19]:
crosstab = pd.crosstab(titanic2["survived"], titanic2["class"])
crosstab

class     First  Second  Third
survived
0            16      27     82
1            32      18     25

In [20]:
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=26.664, p=0.0000

In [24]:
if p > 0.05:
	print('Fail to reject Ho')
else:
	print('We reject the null hypothesis. Class and survived variables are dependent')

We reject the null hypothesis. Class and survived variables are dependent

In [22]:
crosstab = pd.crosstab(titanic2["embarked"], titanic2["class"])
crosstab

class     First  Second  Third
embarked
C            21       2     15
Q             1       2     12
S            26      41     80

In [33]:
#crosstab = pd.crosstab(titanic2["embarked"], titanic2["class"], normalize="columns")
#crosstab

In [23]:
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=30.661, p=0.0000

In [24]:
mpg = sns.load_dataset("mpg")
mpg.sample(7)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
226,20.5,6,231.0,105.0,3425,16.9,77,usa,buick skylark
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
29,27.0,4,97.0,88.0,2130,14.5,71,japan,datsun pl510
194,22.5,6,232.0,90.0,3085,17.6,76,usa,amc hornet
356,32.4,4,108.0,75.0,2350,16.8,81,japan,toyota corolla
134,16.0,6,258.0,110.0,3632,18.0,74,usa,amc matador
144,31.0,4,76.0,52.0,1649,16.5,74,japan,toyota corona

In [25]:
crosstab = pd.crosstab(mpg["origin"], mpg["cylinders"])
crosstab

cylinders  3   4  5   6    8
origin
europe     0  63  3   4    0
japan      4  69  0   6    0
usa        0  72  0  74  103

In [36]:
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=180.102, p=0.0000

In [37]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [26]:
attention = sns.load_dataset("attention")
attention.sample(7)

    Unnamed: 0  subject attention  solutions  score
51          51       12   focused          3    8.0
57          57       18   focused          3    6.0
2            2        3   divided          1    3.0
13          13       14   focused          1    8.0
41          41        2   divided          3    5.0
31          31       12   focused          2    9.0
22          22        3   divided          2    5.0

In [30]:
attention.solutions.unique()

array([1, 2, 3])

In [27]:
attention.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  60 non-null     int64
 1   subject     60 non-null     int64
 2   attention   60 non-null     object
 3   solutions   60 non-null     int64
 4   score       60 non-null     float64
dtypes: float64(1), int64(3), object(1)
memory usage: 2.5+ KB

In [36]:
attention2=attention.sample(40)

In [37]:
crosstab = pd.crosstab(attention2["attention"], attention2["solutions"])
crosstab

solutions   1  2  3
attention
divided     5  6  5
focused    10  9  5

In [38]:
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=0.694, p=0.7066